import { forwardRef } from 'react';
import "./WhyBEC.css"

export const Why = forwardRef((props, ref) => (
    <section className="why" >
        <div className="why_wrap">
            <h1 className="why_title title" ref={ref}>Чому BEC</h1>
            <p className="why_text">
            Хоч мій бестівський шлях ще не дуже великий, проте я перейнявся духом кортіми BEC’у та розумію, що кортіма інженерних змагань саме те, що відповідає мені. У беківцях живе той дух, який можна побачити на будь-яких зборах чи то четвергових, чи то на зборах відділу. Це мене надихає та ще раз запевнює, що BEC – те що мені потрібно.
            <br></br>
            На MW під час симуляції івентів, я потрапив саме в BEC – це доля)). 
            Саме тоді я поставив собі за мету – попасти в кортіму BEC’у. 
            Я переконаний, що в BEC`у я знайду саме те середовище, яке мені потрібно для подальшого розвитку. Я готовий вкладати свій максимум, щоб допомогти команді досягти нових висот і рухатися вперед разом.

            </p>
        </div>
    </section>
));